Revit 2024 API
PipeSystemType Enumeration
 An enumerated type listing all the possible pipe system types for a connector object.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum PipeSystemType
Visual Basic
Public Enumeration PipeSystemType
Visual C++
public enum class PipeSystemType
Members
Member name | Description
UndefinedSystemType |  Pipe System Type is UndefinedSystemClassification.
SupplyHydronic |  Pipe System Type is SupplyHydronic.
ReturnHydronic |  Pipe System Type is ReturnHydronic.
Sanitary |  Pipe System Type is Sanitary.
Vent |  Pipe System Type is Vent.
DomesticHotWater |  Pipe System Type is DomesticHotWater.
DomesticColdWater |  Pipe System Type is DomesticColdWater.
OtherPipe |  Pipe System Type is OtherPipe.
FireProtectWet |  Pipe System Type is FireProtectWet.
FireProtectDry |  Pipe System Type is FireProtectDry.
FireProtectPreaction |  Pipe System Type is FireProtectPreaction.
FireProtectOther |  Pipe System Type is FireProtectOther.
Fitting |  Pipe System Type is Fitting.
Global |  Pipe System Type is Global.
See Also
Autodesk.Revit.DB.Plumbing Namespace